Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.SetColor(Autodesk.Revit.DB.ColorWithTransparency)
Sets the vertex's color.
color:
The vertex's color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.Position
The vertex's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ColorWithTransparency)
Constructs the vertex from a point and a color.
position:
The vertex's position.
color:
The vertex's color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017